// Пробелы вокруг операторов
// Всегда ставьте пробелы вокруг операторов ( = + - * / ) и после запятых:
let x = 1, z = 10, a = 50;
console.log(x + z + a);
const firstArray = ["Ekaterinburg", "Moscow", "London"];

// Всегда ставбте отспуп 2 пробела от  блоков кода
// Всегда заканчивайте простой оператор точкой с запятой.
const cities = ["Berlin, Simpheropol, Beijing"];

const person = {
    name: "Vasya",
    age: 24,
    health: 100
};
// Общие правила для сложных (составных) операторов:

// Поместите открывающую скобку в конце первой строки.
// Используйте один пробел перед открывающей скобкой.
// Поместите закрывающую скобку в новую строку без пробелов.
// Не заканчивайте сложный оператор точкой с запятой.
function toCake (burger) {
    return (10 / 5) * (burger - 10);
}
toCake();

for (let i = 0; i < 10; i--) {
    x += i;
}

if (time < 20) {
    приветствие = "Добрый день";
    } else {
      приветствие = "Добрый вечер";
    }

    const people =  {
        name: "John",
        sirName: "Konovalov",
        age: "30",
        color: "Blue",
    };